Repository: ravado/CherednychokCodeSample
Catalog: ResourcesLibrary/Messages.*.resx
Languages: ru_ru

# CaptionRegistered
source: Registered
ru_ru: Зарегестрированный

# CaptionWarning
source: Warning
ru_ru: Предупреждение

# CodeNotValid
source: Secret code is not valid
ru_ru: Секретный код не действителен

# CodePasswordNotCorrect
source: Secret code or new password is not correct.
ru_ru: Секретный код или пароль указан неверно.

# EmailIncorrect
source: Email is incorrect. User correct email: example@mail.com
ru_ru: Электронная почта неверна. Правильный e-mail: example@mail.com

# EmailSentCode
source: To your email sent a secret code.
ru_ru: На вашу электронную почту выслан секретный код.

source: Function not implemented
ru_ru: Функция не реализована

# Group
source: Group #{0} {1} - {2} canceled mark: {3}
ru_ru: Группа #{0} {1} - {2} отметка:{3}

# GroupNotLeastThreeSymbols
source: Group name can contain minimum 3 letters and numbers, or such splitters as '-', '_', ' '
ru_ru: Имя группы может содержать не менее 3 букв и цифр, и также разветвители '-', '_', ' '

# InitializationNotImplementedDM
source: Initialization mechanism is not implemented for the data model.
ru_ru: Механизм инициализации не реализован для модели данных.

# MiddleNameOnlyLettersToThirty
source: MiddleName can contain only letters (from 1 to 30)
ru_ru: Отчество может содержать только буквы (от 1 до 30)

# NameOnlyLettersToThirty
source: Name can contain only letters (from 1 to 30)
ru_ru: Имя может содержать только буквы (от 1 до 30)

# NewPasswordNotValid
source: New Password is not valid
ru_ru: Новый пароль не действителен

# NewTestDateYourTeacher
source: You have new test - {0}\n Testing date is {1}\n Your teacher is {2}
ru_ru: У вас есть новый тест - {0} \n Дата тестирование: {1} \n Ваш учитель: {2}

# NotTestMode
source: You do not select the test mode! Set to the default test - Learning.
ru_ru: Вы не выбрали тестовый режим! Установленный по умолчанию тест - Обучение.

# PasswordChanged
source: Password successfully changed.
ru_ru: Пароль успешно изменен.

# PasswordNotLeastSixSymbols
source: Password must contain at least 6 symbols
ru_ru: Пароль должен содержать не менее 6 символов

# PasswordNotValid
source: Password is not valid
ru_ru: Пароль не действителен

# QuestionNotFound
source: Test question not found.
ru_ru: Вопрос не найден.

# RegisterSuccessfull
source: Register was successfull, please login now.
ru_ru: Регистрация прошла успешно, можете войти сейчас.

# Role
source: Role #{0} {1} - {2}
ru_ru: Роль # {0} {1} - {2}

# StudentNotGroup
source: Student must have a group!
ru_ru: Студент должен иметь группу!

# SurnameOnlyLettersToThirty
source: Surname can contain only letters (from 1 to 30)
ru_ru: Фамилия может содержать только буквы (от 1 до 30)

# TestEnd
source: The test is complete.
ru_ru: Тест завершен.

# TestStatistic
source: Test '{0}' of '{1}'\n {2}\n Student: {3} from {4}\n Correct answers: {5}/{6}\n Result: {7}
ru_ru: Тест '{0}' из '{1}'\n {2}\n Студент: {3} c {4}\n Верные ответы: {5}/{6}\n Результат: {7}

# TimeEnd
source: Time for completion of the test is over.
ru_ru: Время на прохождение теста закончилось.

# User
source: User #{0}, username: {1} email: {2}\n Role: {3}
ru_ru: Пользователь #{0}, имя пользователя: {1} почта: {2}\n Роль: {3}

# UserAlreadyToken
source: Such username already token, try another.
ru_ru: Такое имя пользователя уже существует, попробуйте другое.

# UserLeastFourSymbols
source: Username must contain at least 4 symbols (letters, numbers and '-', '_', '.')
ru_ru: Имя пользователя должно содержать не менее 4-х символов (буквы, цифры и '-', '.', '_')

# UserNotCorrect
source: Username is not correct.
ru_ru: Имя пользователя неверно.

# UserNotRegistered
source: This Username is not registered in application.
ru_ru: Имя пользователя не зарегистрировано в приложении.

# UserNotValid
source: Username is not valid
ru_ru: Имя пользователя не действительно

# UserPasswordNotCorrect
source: Username or Password is not correct.
ru_ru: Имя пользователя или пароль указан неверно.

# UserPasswordNotFound
source: This bunch Username and Password not found.
ru_ru: Имя пользователя и пароль не найдены.

source: Warning
ru_ru: Предупреждение
